{"format": "graph-model", "generatedBy": "2.2.2", "convertedBy": "TensorFlow.js Converter v2.8.5", "signature": {"inputs": {"Placeholder:0": {"name": "Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"model_outputs:0": {"name": "model_outputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "block2_0_conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv3/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_0_conv4/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv4/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv3/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_0_conv4/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_0_conv4/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_1_slice-Slice0/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "block0_0_conv3/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}}}, {"name": "block0_0_conv3/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "block0_0_conv4/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv4/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "data_bn/data_bn/Rsqrt/_0__cf__0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "data_bn/data_bn/mul_1/_1__cf__1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "24"}]}}}}}, {"name": "conv0/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}}, {"name": "block0_0_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}}}, {"name": "block0_0_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "block0_1_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_1_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_1_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_1_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "block0_1_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}}}, {"name": "block0_1_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_2_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_2_conv0/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "block0_2_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}}}, {"name": "block0_2_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_2_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_2_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "block0_1_slice-Slice1/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block0_1_slice-Slice0/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block0_3_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_3_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_3_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "58"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_3_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "block0_3_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "58"}, {"size": "58"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block0_3_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "58"}]}}}}}, {"name": "block0_0_reshape0/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block0_0_reshape1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block1_0_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_0_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_1_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_1_conv0/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_1_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}}, {"name": "block1_1_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_1_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_1_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_2_conv0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_2_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_2_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_2_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_2_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_2_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_3_conv0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_3_conv0/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_3_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}}, {"name": "block1_3_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_3_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_3_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_4_conv0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_4_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_4_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}}, {"name": "block1_4_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_4_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_4_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_5_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_5_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_5_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}}, {"name": "block1_5_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_5_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_5_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_6_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_6_conv0/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_6_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}}, {"name": "block1_6_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_6_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_6_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_1_slice-Slice1/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block1_1_slice-Slice0/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block1_7_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_7_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_7_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "116"}, {"size": "1"}]}}}}}, {"name": "block1_7_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}}}, {"name": "block1_7_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "116"}, {"size": "116"}]}}}}}, {"name": "block1_7_conv2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "116"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block1_0_reshape0/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block1_0_reshape1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block2_0_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_0_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_1_conv0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}}}, {"name": "block2_1_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_1_conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_1_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_1_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}}}, {"name": "block2_1_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_2_conv0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}}}, {"name": "block2_2_conv0/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_2_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}}}, {"name": "block2_2_conv1/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_2_conv2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_2_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block2_1_slice-Slice1/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block2_1_slice-Slice0/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "block2_3_conv0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_3_conv0/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv0/pad_size/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fc/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "block2_3_conv1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "232"}, {"size": "1"}]}}}}}, {"name": "block2_3_conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "block2_3_conv2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "232"}, {"size": "232"}]}}}}}, {"name": "block2_3_conv2/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}}}, {"name": "block0_0_concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "block2_0_reshape0/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "block0_0_transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "block2_0_reshape1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "conv1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "464"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fc/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "fc/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "data_bn/data_bn/mul", "op": "Mul", "input": ["Placeholder", "data_bn/data_bn/Rsqrt/_0__cf__0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "data_bn/data_bn/add_1", "op": "Add", "input": ["data_bn/data_bn/mul", "data_bn/data_bn/mul_1/_1__cf__1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv0/pad_size", "op": "Pad", "input": ["data_bn/data_bn/add_1", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv0/conv0", "op": "_FusedConv2D", "input": ["conv0/pad_size", "conv0/weights", "conv0/biases"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "pad_size", "op": "Pad", "input": ["conv0/conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "pool0", "op": "MaxPool", "input": ["pad_size"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv0/block0_0_conv0", "op": "_FusedConv2D", "input": ["pool0", "block0_0_conv0/weights", "block0_0_conv0/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "block0_0_conv3/pad_size", "op": "Pad", "input": ["pool0", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv1/pad_size", "op": "Pad", "input": ["block0_0_conv0/block0_0_conv0", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_0_conv3/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block0_0_conv3/pad_size", "block0_0_conv3/weights", "block0_0_conv3/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}}}, {"name": "block0_0_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block0_0_conv1/pad_size", "block0_0_conv1/weights", "block0_0_conv1/biases"], "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block0_0_conv4/block0_0_conv4", "op": "_FusedConv2D", "input": ["block0_0_conv3/depthwise", "block0_0_conv4/weights", "block0_0_conv4/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "block0_0_conv2/block0_0_conv2", "op": "_FusedConv2D", "input": ["block0_0_conv1/depthwise", "block0_0_conv2/weights", "block0_0_conv2/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "block0_0_concat", "op": "ConcatV2", "input": ["block0_0_conv4/block0_0_conv4", "block0_0_conv2/block0_0_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "block0_0_reshape0", "op": "Reshape", "input": ["block0_0_concat", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block0_0_transpose", "op": "Transpose", "input": ["block0_0_reshape0", "block0_0_transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "block0_0_reshape1", "op": "Reshape", "input": ["block0_0_transpose", "block0_0_reshape1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_1_slice-Slice0", "op": "Slice", "input": ["block0_0_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_1_slice-Slice1", "op": "Slice", "input": ["block0_0_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_1_conv0/block0_1_conv0", "op": "_FusedConv2D", "input": ["block0_1_slice-Slice1", "block0_1_conv0/weights", "block0_1_conv0/biases"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block0_1_conv1/pad_size", "op": "Pad", "input": ["block0_1_conv0/block0_1_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "block0_1_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block0_1_conv1/pad_size", "block0_1_conv1/weights", "block0_1_conv1/biases"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}}}, {"name": "block0_1_conv2/block0_1_conv2", "op": "_FusedConv2D", "input": ["block0_1_conv1/depthwise", "block0_1_conv2/weights", "block0_1_conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}}}, {"name": "block0_1_concat", "op": "ConcatV2", "input": ["block0_1_slice-Slice0", "block0_1_conv2/block0_1_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "block0_1_reshape0", "op": "Reshape", "input": ["block0_1_concat", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block0_1_transpose", "op": "Transpose", "input": ["block0_1_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_1_reshape1", "op": "Reshape", "input": ["block0_1_transpose", "block0_0_reshape1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_2_slice-Slice0", "op": "Slice", "input": ["block0_1_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_2_slice-Slice1", "op": "Slice", "input": ["block0_1_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "block0_2_conv0/block0_2_conv0", "op": "_FusedConv2D", "input": ["block0_2_slice-Slice1", "block0_2_conv0/weights", "block0_2_conv0/biases"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "block0_2_conv1/pad_size", "op": "Pad", "input": ["block0_2_conv0/block0_2_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "block0_2_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block0_2_conv1/pad_size", "block0_2_conv1/weights", "block0_2_conv1/biases"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block0_2_conv2/block0_2_conv2", "op": "_FusedConv2D", "input": ["block0_2_conv1/depthwise", "block0_2_conv2/weights", "block0_2_conv2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "block0_2_concat", "op": "ConcatV2", "input": ["block0_2_slice-Slice0", "block0_2_conv2/block0_2_conv2", "block0_0_concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "block0_2_reshape0", "op": "Reshape", "input": ["block0_2_concat", "block0_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block0_2_transpose", "op": "Transpose", "input": ["block0_2_reshape0", "block0_0_transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "block0_2_reshape1", "op": "Reshape", "input": ["block0_2_transpose", "block0_0_reshape1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_3_slice-Slice0", "op": "Slice", "input": ["block0_2_reshape1", "block0_1_slice-Slice0/begin", "block0_1_slice-Slice0/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "block0_3_slice-Slice1", "op": "Slice", "input": ["block0_2_reshape1", "block0_1_slice-Slice1/begin", "block0_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_3_conv0/block0_3_conv0", "op": "_FusedConv2D", "input": ["block0_3_slice-Slice1", "block0_3_conv0/weights", "block0_3_conv0/biases"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block0_3_conv1/pad_size", "op": "Pad", "input": ["block0_3_conv0/block0_3_conv0", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_3_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block0_3_conv1/pad_size", "block0_3_conv1/weights", "block0_3_conv1/biases"], "attr": {"num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "block0_3_conv2/block0_3_conv2", "op": "_FusedConv2D", "input": ["block0_3_conv1/depthwise", "block0_3_conv2/weights", "block0_3_conv2/biases"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_3_concat", "op": "ConcatV2", "input": ["block0_3_slice-Slice0", "block0_3_conv2/block0_3_conv2", "block0_0_concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "block0_3_reshape0", "op": "Reshape", "input": ["block0_3_concat", "block0_0_reshape0/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_3_transpose", "op": "Transpose", "input": ["block0_3_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block0_3_reshape1", "op": "Reshape", "input": ["block0_3_transpose", "block0_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block1_0_conv3/pad_size", "op": "Pad", "input": ["block0_3_reshape1", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv0/block1_0_conv0", "op": "_FusedConv2D", "input": ["block0_3_reshape1", "block1_0_conv0/weights", "block1_0_conv0/biases"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "block1_0_conv3/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block1_0_conv3/pad_size", "block1_0_conv3/weights", "block1_0_conv3/biases"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}}}, {"name": "block1_0_conv1/pad_size", "op": "Pad", "input": ["block1_0_conv0/block1_0_conv0", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_0_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block1_0_conv1/pad_size", "block1_0_conv1/weights", "block1_0_conv1/biases"], "attr": {"explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "block1_0_conv4/block1_0_conv4", "op": "_FusedConv2D", "input": ["block1_0_conv3/depthwise", "block1_0_conv4/weights", "block1_0_conv4/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "block1_0_conv2/block1_0_conv2", "op": "_FusedConv2D", "input": ["block1_0_conv1/depthwise", "block1_0_conv2/weights", "block1_0_conv2/biases"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block1_0_concat", "op": "ConcatV2", "input": ["block1_0_conv4/block1_0_conv4", "block1_0_conv2/block1_0_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_0_reshape0", "op": "Reshape", "input": ["block1_0_concat", "block1_0_reshape0/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block1_0_transpose", "op": "Transpose", "input": ["block1_0_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_0_reshape1", "op": "Reshape", "input": ["block1_0_transpose", "block1_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block1_1_slice-Slice0", "op": "Slice", "input": ["block1_0_reshape1", "block0_1_slice-Slice0/begin", "block1_1_slice-Slice0/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "block1_1_slice-Slice1", "op": "Slice", "input": ["block1_0_reshape1", "block1_1_slice-Slice1/begin", "block1_1_slice-Slice0/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_1_conv0/block1_1_conv0", "op": "_FusedConv2D", "input": ["block1_1_slice-Slice1", "block1_1_conv0/weights", "block1_1_conv0/biases"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "block1_1_conv1/pad_size", "op": "Pad", "input": ["block1_1_conv0/block1_1_conv0", "conv0/pad_size/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_1_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block1_1_conv1/pad_size", "block1_1_conv1/weights", "block1_1_conv1/biases"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block1_1_conv2/block1_1_conv2", "op": "_FusedConv2D", "input": ["block1_1_conv1/depthwise", "block1_1_conv2/weights", "block1_1_conv2/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "block1_1_concat", "op": "ConcatV2", "input": ["block1_1_slice-Slice0", "block1_1_conv2/block1_1_conv2", "block0_0_concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_1_reshape0", "op": "Reshape", "input": ["block1_1_concat", "block1_0_reshape0/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_1_transpose", "op": "Transpose", "input": ["block1_1_reshape0", "block0_0_transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_1_reshape1", "op": "Reshape", "input": ["block1_1_transpose", "block1_0_reshape1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "block1_2_slice-Slice0", "op": "Slice", "input": ["block1_1_reshape1", "block0_1_slice-Slice0/begin", "block1_1_slice-Slice0/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "block1_2_slice-Slice1", "op": "Slice", "input": ["block1_1_reshape1", "block1_1_slice-Slice1/begin", "block1_1_slice-Slice0/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "block1_2_conv0/block1_2_conv0", "op": "_FusedConv2D", "input": ["block1_2_slice-Slice1", "block1_2_conv0/weights", "block1_2_conv0/biases"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "block1_2_conv1/pad_size", "op": "Pad", "input": ["block1_2_conv0/block1_2_conv0", "conv0/pad_size/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "block1_2_conv1/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["block1_2_conv1/pad_size", "block1_2_conv1/weights", "block1_2_conv1/biases"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "block1_2_conv2/block1_2_conv2", "op": "_FusedConv2D", "input": ["block1_2_conv1/depthwise", "block1_2_conv2/weights", "block1_2_conv2/biases"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "block1_2_concat", "op": "ConcatV2", "input": ["block1_2_slice-Slice0", "block1_2_conv2/block1_2_conv2", "block0_0_concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, 